const SiteRule = () => {
    return (
        <>
            {/* 利用規約 */}
            <div>
                <h2>利用規約</h2>
                <h3>1.はじめに</h3>
                <p>ともきちのITブログ（以下「本サイト」）をご利用いただくにあたり、以下の利用規約（以下「本規約」）をお読みいただき、同意したうえでご利用ください。</p>
                <p>本サイトの利用をもって、本規約に同意したこととなります。</p>
                <h3>2.利用資格</h3>
                <p>本サイトは、インターネット接続環境を有する個人または法人の方にご利用いただけます。</p>
                <p>利用者は、ブログ記事の閲覧を目的として本サイトを利用し、他の目的での利用は許可されません。</p>
                <h3>3.禁止事項</h3>
                <p>利用者は以下の行為を行ってはなりません。</p>
                <ul>
                    <li>本サイトのコンテンツを無断で転載、配布、販売、改変すること。</li>
                    <li>他の利用者や第三者の権利を侵害する行為。</li>
                    <li>不正アクセスやサーバへの攻撃など技術的な攻撃を行うこと。</li>
                    <li>スパム行為や、広告目的で無断でコメント・メッセージを送ること。</li>
                </ul>
                <h3>4.免責事項</h3>
                <p>本サイトの情報は正確性を期していますが、誤りや不正確な情報が含まれている可能性があります。</p>
                <p>本サイトは、掲載されている情報について、利用者がどのような損害を被った場合でも一切責任を負いません。</p>
                <h3>5.サービスの変更・終了</h3>
                <p>本サイトは、予告なしにサービス内容を変更、停止または終了することがあります。</p>
                <h3>6.広告</h3>
                <p>本サイトでは、Google AdSenseなどの広告サービスを利用しています。</p>
                <p>広告には、利用者のウェブサイト閲覧履歴に基づく広告が表示されることがあります。</p>
                <h3>7.プライバシー</h3>
                <p>利用者の個人情報の取り扱いについては、以下プライバシーポリシーに記載された通りです。</p>
                <h3>8.規約の変更</h3>
                <p>本規約は予告なく変更される場合があります。</p>
                <p>変更後に本サイトを利用した場合、変更後の規約に同意したものとみなされます。</p>
                <h3>9.準拠法</h3>
                <p>本規約は、日本の法律に基づいて解釈され、適用されます。</p>
            </div>

            <hr />

            {/* プライバシーポリシー */}
            <div>
                <h2>プライバシーポリシー</h2>
                <h3>1.はじめに</h3>
                <p>本プライバシーポリシー（以下「本ポリシー」）は、本サイトがどのようにしてユーザーの個人情報を収集、使用、管理するかについて説明します。</p>
                <p>本サイトを利用することにより、ユーザーは本ポリシーに同意したことになります。</p>
                <h3>2.収集する情報</h3>
                <p>本サイトは、以下の情報を収集する場合があります。</p>
                <ul>
                    <li><b>閲覧データ</b>:ユーザーが本サイトを訪問した際に自動的に収集される情報（ＩＰアドレス、ブラウザの種類、アクセスしたページ、滞在時間など）。</li>
                    <li><b>広告</b>:Google AdSenseやBingなどの広告配信サービスにより、ユーザーのウェブサイト利用履歴を基にしたターゲット広告が表示されることがあります。</li>
                    <li><b>Google Analytics</b>:サイトの利用状況を分析するために、Google Analyticsを使用して、ユーザーの動向を追跡します。この情報は匿名で収集され、個人を特定するものではありません。</li>
                </ul>
                <h3>3.利用目的</h3>
                <p>収集した情報は以下の目的で利用されます。</p>
                <ul>
                    <li>サイトのコンテンツや広告の最適化。</li>
                    <li>ユーザーのウェブサイト利用状況を分析し、サイトの改善を行うため。</li>
                    <li>必要に応じて、法的要求に応じるため。</li>
                </ul>
                <h3>4.情報の共有と第三者提供</h3>
                <p>本サイトは、ユーザーの個人情報を第三者に提供することはありません。</p>
                <p>ただし、以下の場合を除きます。</p>
                <ul>
                    <li>Google AdSenseやBingなどの広告ネットワークに対して提供されるデータ。</li>
                    <li>法的要求に基づく場合。</li>
                </ul>
                <h3>5.クッキー（Cookie）の使用</h3>
                <p>本サイトでは、ユーザーのパフォーマンス向上のためにクッキーを使用しています。</p>
                <p>クッキーを使用することにより、サイトの使いやすさやパフォーマンスを向上させます。</p>
                <p>ユーザーはブラウザ設定でクッキーを無効にすることができますが、その場合一部の昨日が正しく動作しない場合があります。</p>
                <h3>6.データのセキュリティ</h3>
                <p>本サイトは、収集した情報の安全性を保つため、適切な技術的および組織的対策を講じていますが、インターネットを通じた情報の安全なセキュリティを保証することはできません。</p>
                <h3>7.外部リンク</h3>
                <p>本サイトは外部のウェブサイトへのリンクを含むことがありますが、外部サイトのプライバシーポリシーについては責任を負いません。</p>
                <p>リンク先のプライバシーポリシーをご確認ください。</p>
                <h3>8.ポリシーの変更</h3>
                <p>本ポリシーは予告なく変更されることがあります。</p>
                <p>変更後に本サイトを利用した場合、変更後のポリシーに同意したものとみなされます。</p>
            </div>

        </>
    );
}

export default SiteRule;
